SELECT Телефон FROM Учасник 
WHERE Імя='Олег' AND Прізвище='Гацько'

SELECT Прізвище, Імя, Дата_заключення, Дата_закінчення
FROM Учасник AS У
LEFT JOIN Договір AS Д ON У.Код_учасника=Д.Код_учасника

SELECT Назва_колективу, 
(SELECT Прізвище FROM Учасник WHERE Д.Код_учасника=Учасник.Код_учасника) 
as Прізвище,
Дата_заключення, Дата_закінчення
FROM Договір AS Д
INNER JOIN КОЛЕКТИВ AS К ON Назва_колективу = 'Ценат' 
AND К.Код_колективу = Д.Код_колективу

SELECT * FROM Учасник
WHERE NOT EXISTS
(SELECT Код_договору FROM Договір 
WHERE Договір.Код_учасника=Учасник.Код_учасника)

SELECT Прізвище, Імя FROM Учасник, Договір
WHERE Учасник.Код_учасника=Договір.Код_договору
AND Дата_закінчення>'2020-11-06'
AND Дата_закінчення<'2020-12-06'
