BEGIN TRANSACTION;
INSERT INTO Учасник
VALUES (6, 'Степан', 'Іваненко','Петрович','Львів','Крива','11','11', 975925865, '2017-03-10','m');
INSERT INTO Учасник 
VALUES (5, 'Іванка', 'Степаненка','Йосифівна','Львів','Пряма','11','11', 975252865, '2017-03-10','w');
INSERT INTO Учасник 
VALUES (4, 'Ігор', 'Бурий','Степанович','Львів','Велика','11','11', 975958365, '2017-03-10','m');
COMMIT; 
BEGIN TRANSACTION;
INSERT INTO Учасник
VALUES (7, 'Степан', 'Іваненко','Петрович','Львів','Крива','11','11', 975925865, '2017-03-10','m');
INSERT INTO Учасник 
VALUES (8, 'Іванка', 'Степаненка','Йосифівна','Львів','Пряма','11','11', 975252865, '2017-03-10','w');
INSERT INTO Учасник 
VALUES (9, 'Ігор', 'Бурий','Степанович','Львів','Велика','11','11', 975958365, '2017-03-10','m');
COMMIT;
