CREATE VIEW УчасникВ AS	
SELECT DISTINCT Код_учасника, Прізвище, Імя FROM Учасник

CREATE VIEW ДоговірВ AS	
SELECT DISTINCT * FROM Договір

SELECT * FROM ДоговірВ
WHERE Дата_заключення >='2020-10-06'

SELECT УчасникВ.Прізвище, УчасникВ.Імя, ДоговірВ.Дата_закінчення as 'Дійсний до'
FROM УчасникВ, ДоговірВ
WHERE УчасникВ.Код_учасника=ДоговірВ.Код_учасника

SELECT УчасникВ.Прізвище, УчасникВ.Імя, ДоговірВ.Дата_закінчення as 'Дійсний до'
FROM УчасникВ, ДоговірВ
WHERE УчасникВ.Код_учасника=ДоговірВ.Код_учасника 
AND УчасникВ.Код_учасника IN (1,2)
